fio-plugin-log/fio-plugin_8ssd_4qd.log
test: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=spdk, iodepth=4
fio-2.18
Starting 1 thread
Starting DPDK 17.05.0 initialization...
[ DPDK EAL parameters: fio -c 0x1 -m 512 --file-prefix=spdk_pid4989 ]
test: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=spdk, iodepth=4
fio-2.18
Starting 1 thread
Starting DPDK 17.05.0 initialization...
[ DPDK EAL parameters: fio -c 0x1 -m 512 --file-prefix=spdk_pid5641 ]
EAL: Probing VFIO support...
EAL: PCI device 0000:83:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:84:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:85:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:86:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:87:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:88:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:89:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:8a:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme

test: (groupid=0, jobs=1): err= 0: pid=5688: Tue Jul 11 07:39:23 2017
   read: IOPS=45.1k, BW=176MiB/s (185MB/s)(51.7GiB/300001msec)
    slat (usec): min=0, max=3, avg= 0.02, stdev= 0.14
    clat (usec): min=5, max=3585, avg=88.35, stdev=73.19
     lat (usec): min=5, max=3585, avg=88.37, stdev=73.19
    clat percentiles (usec):
     |  1.00th=[   66],  5.00th=[   71], 10.00th=[   73], 20.00th=[   78],
     | 30.00th=[   79], 40.00th=[   80], 50.00th=[   81], 60.00th=[   89],
     | 70.00th=[   94], 80.00th=[   95], 90.00th=[   96], 95.00th=[   97],
     | 99.00th=[  103], 99.50th=[  169], 99.90th=[ 1416], 99.95th=[ 2160],
     | 99.99th=[ 2768]
    lat (usec) : 10=0.01%, 20=0.01%, 50=0.02%, 100=98.80%, 250=0.82%
    lat (usec) : 500=0.15%, 750=0.04%, 1000=0.03%
    lat (msec) : 2=0.07%, 4=0.06%
  cpu          : usr=99.86%, sys=0.00%, ctx=85, majf=0, minf=1209
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=13528425,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=176MiB/s (185MB/s), 176MiB/s-176MiB/s (185MB/s-185MB/s), io=51.7GiB (55.5GB), run=300001-300001msec